app/views/sections/_form.html.erb

SELECT "pages".* FROM "pages"
---
		<%= f.label :page_id %><br />
		<%= f.select :page_id, (Page.all.collect {|p| [p.name, p.id]}) %>