app/views/pages/_form.html.erb

SELECT "subjects".* FROM "subjects"
---
		<%= f.label :subject_id %><br />
		<%= f.select :subject_id, (Subject.all.collect {|s| [s.name, s.id]}) %>