app/views/pages/index.html.erb

<div class='page_title_sub'>
	<%= pluralize(@pages.size, 'Page') %> Found
---
SELECT "pages".* FROM "pages"