app/views/subjects/index.html.erb

SELECT "subjects".* FROM "subjects"
---
<div class='page_title_sub'>
	<%= pluralize(@subjects.size, 'Subject') %> Found

SELECT COUNT(*) FROM "pages" WHERE ("pages".subject_id = 1)
---
		<td><%= subject.visible? ? 'Yes' : 'No' %></td>
		<td><%= subject.pages.size %></td>