app/views/subjects/show.html.erb

				<ul style="list-style-type:none; padding-left:0;">
					<% @subject.pages.each do |page| %>
---
SELECT "pages".* FROM "pages" WHERE ("pages".subject_id = 1)