app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages"
---
  def index
    @pages = Page.all

SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1
---
  def show
    @page = Page.find(params[:id])

SELECT COUNT(*) FROM "pages"
---
  def new
    @page = Page.new
    @page_count = Page.count + 1

INSERT INTO "pages" ("subject_id", "name", "permalink", "position", "visible", "created_at", "updated_at") VALUES (NULL, '', '', NULL, 'f', '2011-05-16 04:20:51.206035', '2011-05-16 04:20:51.206035')
---
  def create
    @page = Page.new(params[:page])
    if @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "pages"
---
  def edit
    @page = Page.find(params[:id])
    @page_count = Page.count

SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1
UPDATE "pages" SET "subject_id" = 25, "position" = 1, "updated_at" = '2011-05-17 06:14:55.330884' WHERE "pages"."id" = 4
---
  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(params[:page])

SELECT "pages".* FROM "pages" WHERE "pages"."id" = 3 LIMIT 1
DELETE FROM "pages" WHERE "pages"."id" = 3
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy