app/controllers/sections_controller.rb

  def index
    @sections = Section.all
---
SELECT "sections".* FROM "sections"

  def show
    @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1

  def new
    @section = Section.new
    @section_count = Section.count + 1
---
SELECT COUNT(*) FROM "sections"

  def create
    @section = Section.new(params[:section])
    if @section.save
      flash[:notice] = "Congratulations, #{@section.name} has been added as a section."
      redirect_to @section
    else
      @section_count = Section.count + 1
---
INSERT INTO "sections" ("page_id", "name", "position", "visible", "content_type", "content", "created_at", "updated_at") VALUES (NULL, 'Forty Nights At Sea', 8, 't', NULL, NULL, '2011-05-16 15:51:45.434550', '2011-05-16 15:51:45.434550')
SELECT COUNT(*) FROM "sections"

  def edit
    @section = Section.find(params[:id])
    @section_count = Section.count
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "sections"

  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(params[:section])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
UPDATE "sections" SET "content" = 'Here is the content for the article, I''m going to attempt to use the truncate command on this, but only for the index view, not the show page. Here is the content for the article, I''m going to attempt to use the truncate command on this, but only for the index view, not the show page.

  def destroy
    @section = Section.find(params[:id])
    @section.destroy
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 2 LIMIT 1
DELETE FROM "sections" WHERE "sections"."id" = 2