app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def show
    @subject = Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 1 LIMIT 1

  def new
    @subject = Subject.new
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM "subjects"

  def create
    @subject = Subject.new(params[:subject])
    if @subject.save
      flash[:notice] = "Congratulations, #{@subject.name.capitalize} has been added as a new subject!"
      redirect_to @subject
    else
      @subject_count = Subject.count + 1
---
INSERT INTO "subjects" ("name", "position", "visible", "created_at", "updated_at") VALUES ('Reading Books', 3, 't', '2011-05-16 00:26:06.734733', '2011-05-16 00:26:06.734733')
SELECT COUNT(*) FROM "subjects"

  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "subjects"

  def update
    @subject = Subject.find(params[:id])
    if @subject.update_attributes(params[:subject])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 1 LIMIT 1
UPDATE "subjects" SET "position" = 3, "visible" = 't', "updated_at" = '2011-05-17 04:58:01.423622' WHERE "subjects"."id" = 24

  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 2 LIMIT 1
DELETE FROM "subjects" WHERE "subjects"."id" = 2